/**
 * 
 * Simple Tickets System - Made by Lyex
 * Lyex (c) 2019
 * 
 */ 

module.exports = {
    "bot": {
        "token": "insert your bot token here", // قم بإضافة التوكن الخاص في البوت هنا
        "owner": ['your id'], // قم بإضافة الآيدي الخاص بحسابك هنا لتممكن من الوصول إلى جميع الأوامر. 
        /**
         * 
         * إذا أردت إضافة أكثر من آيدي كل ماعليك فعله هنا إضافة خانة آخرى في المصفوفة
         * ['your id', 'id 2'] وهكذا.. 
         * 
         */ 
        "prefix": ["!"] // الحرف/الكلمة/الرمز الدلالي لأستخدام أوامر البوت.
        /**
         * 
         * إذا اردت إضافة بريفكس آخر
         * قم بإضافة خانة أخرى للمصفوفة..
         * ["!", "$"] 
         * 
         */ 
    },
    "tickets": {
        "roles": {
            "support": "Support Role ID", // آيدي رتبة السبورت
            "supervisor": "Supervisor Role ID" // آيدي رتبة المشرف على التذاكر, بتنضاف لها مزايا قريب لو فيه دعم جيد.. حاليا مالها فائدة تقدر تتركها فارغه
        },
        "messages": {
            "welcome": "شكرا لتواصلك معنا, يرجى كتابة التفاصيل وراء إفتتاح هذه التذكرة\nفريق الدعم سيكون بخدمتك قريبا.. قم بإتباع التعليمات ريثما يصل الدعم :thumbsup:"
        },
        "category": "Tickets Category ID" // آيدي القسم الي تنضاف له التذاكر, اتركه كما هو لو ماتبي يضيف لقسم..
    }
}